import 'package:flutter_app/article/db/article_provider.dart';

/// author : "希区柯克"
/// title : "门牙"
/// digest : "太阳穿过厚厚的窗帘，照在杜克警官的房间，我们正在他的房间里。 我掏出手枪，对着他宽阔的腰部，他露出惊讶的神情。 “罗伯特，”他是，“你这是干"
/// content : "<p>太阳穿过厚厚的窗帘，照在杜克警官的房间，我们正在他的房间里。 </p><p>我掏出手枪，对着他宽阔的腰部，他露出惊讶的神情。 </p><p>“罗伯特，”他是，“你这是干什么？” </p><p>“你觉得我在干什么？” </p><p>“你在开玩笑。” </p><p>“别动，”我说。“我不是开玩笑，杜克，你猜不出来吗？” </p><p>“哥儿们，别把那东西对着我。” </p><p>“我不是你的哥儿们，杜克。” </p><p>我非常憎恨他，也非常担心失去琼，迫不及待地想要扣动扳机，但是，我渴望看到杜克惊慌的样子，他应该知道到底是怎么回事。 </p><p>他咽了一口唾沫，皱皱眉，咧了咧嘴，露出一颗门牙，那颗门牙歪歪的，好像随时就要掉下来。他伸手摸了一下那颗牙，然后捋了捋稀疏的金发，黑眼睛紧盯着我。 </p><p>“好，罗伯特，这是怎么回事？” </p><p>“我要杀了你，杜克，你知道为什么吗？” </p><p>“你一定是在开玩笑，罗伯特，”他眼中显出困惑的神情，因为他渐渐明白，我是来跟他算账的。他正在努力想出个</p><p>头绪。 </p><p>“你知道是怎么回事，对吗？” </p><p>他眼睛一亮，然后又黯淡下来，他试图笑笑，举起一只手，又放下。 </p><p>“你和琼，”我说，“你认为你们瞒得住，以为我不知道——”“琼？”他说。“原来是这么回事。” </p><p>“你们玩了不少花样，”我说，非常愤怒。“她是我的，杜克，你早该明白。 </p><p>我们共事多年，你知道，谁夺走我的情人，我都受不了“”罗伯特，你把事情想清楚，琼不是你太太，她是一位小姐，一位不属于任何人的小姐。我是和她约会，但那又怎么了？你迟早会发现，琼准备告诉你的。“ </p><p>“她没有告诉我，现在她也不必了，她可以彻底忘记你了，杜克。” </p><p>“罗伯特，”他说，举起双手，向前迈了一步。“罗伯特，听我说”最好站祝“他站在那里，你可以从他的眼睛里看出，他知道我不是在开玩笑，但是，他试图想办法让我回心转意。 </p><p>他并不了解我，我们在刑侦科共事六年，他并不了解我，但是，他知道，我是说到做到的。 </p><p>“你干这种事，他们会抓到你的，”他说。“你知道，罗伯特，你不能做这种事。再说，琼只是一个女孩子，罗伯特，我们是朋友。” </p><p>“我爱她，”我说。“她爱我，你从中破坏，杜克，我们是准备结婚的。” </p><p>“你疯了，罗伯特。” </p><p>“我爱她，你听到没有？” </p><p>“她对我只是一个普通的小妞，罗伯特，你得——”砰砰两声枪响。 </p><p>手枪在我手中轻轻跳动，杜克胸口中了两枪，站了一会儿，他大张着嘴，向前倒去，落地的时候，下巴啪地响了一声。 </p><p>我用脚把他翻过来，低头看他。他的嘴巴张开着，那颗该死的门牙不见了。一定是他倒地时，吞了下去。他的两眼仍然很明亮，然后渐渐变得呆滞，他是死定了。再见，杜克，你这个坏东西。 </p><p>我擦擦枪，把它扔到尸体旁，离开那里。现在，我觉得好多了，真的好多了。 </p><p>但是，有一种怪怪的感觉，胸部有一种刺痛感，像是吸不够空气一样。这种感觉以前也有过，每当我担心什么的时候。 </p><p>就会有这种感觉，现在有什么可担心的呢？ </p><p>我到琼的住处。 </p><p>她笑着开了门。因为心怀鬼胎，她的笑脸并没有让我很高兴，但我并不在意，现在她是我的了。 </p><p>“嘿，罗伯特。” </p><p>“宝贝。” </p><p>我们互相望着对方，我不能相信她和杜克约会，但那是事实。 </p><p>“你怎么到这儿来了？”她说。 </p><p>“来看看你，局里的人知道我在这里，我告诉他们我可能来吃午饭。” </p><p>“现在不是午饭时间，罗伯特。” </p><p>“我正在办件事，还没有吃午饭。” </p><p>“我给你做点东西，三明治怎么样？” </p><p>“好，我不是很饿。” </p><p>我怎么看她都看不够，她真漂亮，长长的金发，心形的脸庞，丰满的嘴唇，一对动人的眼睛。她穿着一件鲜艳的黄色短裙子，看上去秀色可餐。她对我太重要了。 </p><p>她住在一间小画室里，自己画一点画，同时接受别人的委托出售一些画。 </p><p>“到厨房里来。”她说。 </p><p>我们走进厨房，我正要伸手抱她，电话铃响了。我有点紧张，但不可能这么快，会是打给我的吗？唔，可能是打给我的，因为杜克和我一向很亲近，但也可能不是找我的，我很紧张。她跑去接电话。 </p><p>“是的，是的，他在这儿。罗伯特？” </p><p>我走过去，接过电话，那是亨利警官，他告诉我杜克遇害，他们要我负责这个案子。亨利和我关系很好，他知道我对杜克的感情。 </p><p>“真让人难过，罗伯特。” </p><p>“你是说在他的公寓？” </p><p>“是的，在那里。” </p><p>“我就来，”我挂上电话，悲伤地看着琼。 </p><p>“什么事？”她问。 </p><p>我犹豫了一会儿，觉得自己就像个魔鬼，然后很平静地说：“是杜克的事，他遇害了。” </p><p>她怔住了。“你是说杜克？” </p><p>“是的。” </p><p>她用手指抚弄着自己的裙子，两眼一片茫然。 </p><p>“噢，”她说。“他们打电话叫你去办？” </p><p>“是啊，”我懒洋洋地说，我忍不祝 </p><p>她想说什么，但说不出来，这更使我难受。然后，她声音清晰地说：“那么，罗伯特，你还是赶快过去吧。” </p><p>“当然。” </p><p>我点点头，我得离开这儿。过一会儿，我会显得自然，但是现在不行。 </p><p>我到杜克的公寓，我看看他，哼哼哈哈支吾着，摄影人员在拍照，指纹组的人在提取指纹。我留在那里，到处翻翻，装出一副查看现场的样子。当我离开时，天已经黑了。那真是漫长的一天。 </p><p>我离开时，亨利刚好走进楼下的走廊。 </p><p>“有什么发现？”他问。 </p><p>我耸耸肩。 </p><p>“今晚告诉我好吗？那时候我们可以认真讨论。嘿，今晚你过来吗？” </p><p>“当然过来，亨利。” </p><p>他朝电梯走去，我走到外面，心想，他苍白的脸和柔和的眼睛是多么诚实啊！ </p><p>每星期二晚上，亨利和我总要聚一聚，喝点酒，我们俩都喜欢喝酒。我们坐着，聊聊案子，这习惯已经有三年了。亨利是个好人。 </p><p>我到琼的住处，在那里很不舒服。她先是不停他说话、微笑，然后就坐在那里，那种沉默简直要让我发疯了。 </p><p>最后，她走到我坐的椅子旁，坐在椅子的扶手上，她的臀部碰到我的肩膀，一只手抚弄着我的头发。“啊，”她说。“就剩下你我两人了。” </p><p>“对极了。” </p><p>她探过身，轻轻吻吻我的额头。我像块木头一样坐着。我成功了，一切都会顺利起来的。 </p><p>“我随便吃点东西，”我说。“我要去见亨利，今天是星期一晚上。” </p><p>“我给你做一点什么。” </p><p>“不用了，我到街上买点吃，谢谢你，宝贝。” </p><p>“可是我喜欢给你做点吃的东西。” </p><p>“我不饿，琼。” </p><p>“我明白了，好吧，罗伯特。” </p><p>“也许回头再来看你。” </p><p>她冲我笑笑。“好吧。” </p><p>我在街上小店买了一个三明治，非常难吃。平常我最喜欢五香牛肉，但今天它吃起来一点味道也没有。我厌恶地离开了。 </p><p>亨利亲自开门。 </p><p>“你好。”我说。 </p><p>“海伦正要去看电影，屋里就我们两人。” </p><p>海伦从过道走过来，她活泼开朗，穿着茶色外套，正在把厚厚的黑发弄到领子外面。她说：“罗伯特，你好，别喝多了。” </p><p>“今晚应该喝白酒，”亨利说。 </p><p>“你们两个别喝醉了，”她吻吻亨利，拧了一下他的手臂，然后走了。 </p><p>我们走进客厅，面对面在壁炉旁坐下。 </p><p>“喝吗？” </p><p>“当然。” </p><p>“白葡萄酒，”他说，举起一个细长的瓶子。“很漂亮啊！” </p><p>“你从哪儿弄来的？” </p><p>“这是进口的，最上等的，我都等不及了。” </p><p>“下个星期我要请客，亨利，我弄到了一样会让你大吃一惊的东西。” </p><p>“啊，那我得看看。” </p><p>他倒了酒，我们坐在那里慢慢喝，同样是好酒，但往日的那种欢乐气氛没有了。 </p><p>“杜克的事你查到什么了？”他终于开口问道。 </p><p>我点着烟斗，靠在椅背上，吸着烟。我说：“我认为，那是仇杀，由某些歹徒策划的。你知道杜克这个人，杜克打开门，让他进去，嘿，他们是怎么——”我停下来，我正想问他，他们怎么这么快就发现尸体。 </p><p>“什么？”亨利问。 </p><p>“事情发生在发现前不久？” </p><p>“一个小时，也许半个小时之前，清洁女工发现的。” </p><p>“他吞下了他的大门牙，”我说，“可怜的杜克的门牙，那颗牙一直让他心烦。” </p><p>“不，”亨利说。“他并没有吞下，罗伯特，验尸没有发现，也不在他的喉部，我们到处找，也没有找到。” </p><p>“我要抓住杀他的凶手，亨利，一定要抓住我真不敢相信杜克死了。” </p><p>“我知道你的感受，罗伯特。” </p><p>我吸烟。 </p><p>“你怎么样？和琼相处得还好吗？” </p><p>“好。” </p><p>“我说，罗伯特，我们以后再谈杜克的事吧，现在谈点别的吧。 前天出了件怪事。“ </p><p>“哦？” </p><p>“有人在钟楼杀人。” </p><p>我很感兴趣，把身体向后一靠，右腿踝放到左膝盖上，习惯性地开始转动，这时，有东西落到地上。 </p><p>亨利坐在那里看看我，又看看地板，他那样子让我觉得很奇怪。 </p><p>“亨利，钟楼案子是怎么回事？” </p><p>“罗伯特——”他蹲在地上，捡起一样东西。 </p><p>我把右脚从膝盖上放下，凝视着亨利的手。他伸出手掌，掌中是杜克的门牙。 </p><p>“它从你裤脚的反褶部分掉下来的，罗伯特，我亲眼看见的，”亨利说。“亲眼看见它掉下来，落到地板上。” </p><p>我们互相看着对方，亨利站起身，托着那颗该死的门牙，站在那里。我可以想像得出，它是杜克下巴碰到地上时，弹到我裤脚的反褶部分的。 </p><p>“是不是因为琼？”亨利问。 </p><p>“是埃” </p><p>“我知道那事，罗伯特，我以为你和杜克的事会和平解决。他对女人就是那样的，谁都要勾引。” </p><p>“是埃” </p><p>“杜克即使罪该万死，但是，你不能做这种事。杀人是犯法的，罗伯特。”亨利说、“你最好把你的手枪给我。” </p><p>我把枪递给他，然后说：“如果我喝完这杯酒，你不介意吧？” </p><p>亨利看着我说：“你可以喝完整瓶酒，罗伯特，我一点也不想喝。”</p>"
/// id : 3626
/// curr : "2018-07-04"
/// next : "2018-07-05"
/// prev : "2018-07-03"

class Article {
  String author;
  String title;
  String digest;
  String content;
  int id;
  String curr;
  String next;
  String prev;

  static Article fromMap(Map<String, dynamic> map) {
    if (map == null) return null;
    Article articleBean = Article();
    articleBean.author = map['author'];
    articleBean.title = map['title'];
    articleBean.digest = map['digest'];
    articleBean.content = map['content'];
    articleBean.id = map['id'] ??= map['id'];
    articleBean.curr = map['curr'];
    articleBean.next = map['next'];
    articleBean.prev = map['prev'];
    return articleBean;
  }

  Map toJson() => {
        "${ArticleProvider.columnAuthor}": author,
        "${ArticleProvider.columnTitle}": title,
        "${ArticleProvider.columnDigest}": digest,
        "content": content,
        "id": id,
        "${ArticleProvider.columnDate}": curr,
        "next": next,
        "prev": prev,
      };

  Map<String, dynamic> toMap() => {
        "${ArticleProvider.columnAuthor}": author,
        "${ArticleProvider.columnTitle}": title,
        "${ArticleProvider.columnDigest}": digest,
        "${ArticleProvider.columnDate}": curr,
      };
}
